{"text": "Abe is a practical, passionate, and thoughtful teacher who knows how to balance between making sure that students are learning the material and getting fair grades.", "meta": {"filename": "202020SEIS632-03.txt", "linenum": 0, "sentnum": 0}}
{"text": "My only feedback is that the class seems to be covering a lot of materials, 3 hours and 15 mins don't seem enough to cover it all, at some point by the end of each class most students check out and it became just a matter of being there, maybe a better distribution of class activity will be helpful, more peer interaction and cut back on some of the material or demand that student read three pages which covers the basics of each day's class before they come to the class.", "meta": {"filename": "202020SEIS632-03.txt", "linenum": 0, "sentnum": 1}}
{"text": "Professor Abe was an absolute blessing to have as we transitioned to online learning.", "meta": {"filename": "202020SEIS632-03.txt", "linenum": 1, "sentnum": 0}}
{"text": "He was approachable, funny, and so helpful in anything that we needed.", "meta": {"filename": "202020SEIS632-03.txt", "linenum": 1, "sentnum": 1}}
{"text": "Great and understanding instructor who handled the difficulties well throughout the semester.", "meta": {"filename": "202020SEIS632-03.txt", "linenum": 2, "sentnum": 0}}
{"text": "I enjoyed a lot of the content, as well as getting experience using R Studio, of which I wish there were perhaps not more assignments but more challenging assignments.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 0, "sentnum": 0}}
{"text": "You come across as very nice and lenient grading, and your teaching style was good at the start of the class, but as the material got more difficult it seemed you faltered more during the lectures going over the slides.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 0, "sentnum": 1}}
{"text": "If you struggle with explaining this content to us, then we will also struggle.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 0, "sentnum": 2}}
{"text": "I feel like my knowledge of the most difficult content is shaky.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 0, "sentnum": 3}}
{"text": "Following along with your thought process as you solve a problem, only to have you get the wrong answer and backpedal, made it hard to develop the correct way to approach a problem, ie requiring knowledge of the answer beforehand.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 0, "sentnum": 4}}
{"text": "I suggest getting more familiar with these slides, or if they are not your own slides, making your own set as a fresh start.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 0, "sentnum": 5}}
{"text": "I give this professor a lot of credit for choosing a solid text, responding quickly to questions via a variety of forms of communication, and for soliciting and acting on feedback to improve his class.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 0}}
{"text": "He's approachable, knowledgeable and I believe he cares about the success of his students.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 1}}
{"text": "Unfortunately, like so many classes in the grad software program, this class is characterized by: 1.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 2}}
{"text": "An assignment to read a chapter 2.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 3}}
{"text": "A class session spent going over PowerPoint slides that reiterate what was in the chapter but without bringing focus or clarity to the material 3.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 4}}
{"text": "A smallish assignment that checks the box for \"hands on work\" 4.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 5}}
{"text": "Two massive tests that comprise 60-80% of the grade (60% in this particular class) I believe this class, like so many others in the grad software program, would benefit from being flipped.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 6}}
{"text": "Lectures should be viewed in video form outside of class while class time should be spent doing hands on work or exercise problems with the professor present to guide and assist.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 7}}
{"text": "This hands on work should highlight the most important material from the book and ideally would reiterate concepts from previous class sessions.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 8}}
{"text": "I believe the \"bunch of lectures and two big tests\" system that so many professors in this program seem to implement simply isn't conducive to learning.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 9}}
{"text": "People tend to learn best with lots of opportunities for success and failure that present important concepts to them again and again in a variety of situations.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 10}}
{"text": "Having two large tests that comprise so much of a grade simply incentivizes students to cram and forget, instead of pushing them to exercise and internalize.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 11}}
{"text": "I'd also acknowledge that the \"bunch of lectures and two big tests\" system is certainly easier on professors who may be carrying a large course load.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 12}}
{"text": "Crafting a flipped course, or one with more focused and exercise-based material, is no small task.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 13}}
{"text": "But the frequency of this model in the St. Thomas grad software program is disheartening - especially at $3,400 per class.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 14}}
{"text": "So while I don't fault Prof. Kazamzadeh for being another in a long line of professors who run a class in the \"read, lecture, pass two massive tests\" style, it's frustrating that I'm writing a review like this once again.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 1, "sentnum": 15}}
{"text": "I am struggling in this class.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 2, "sentnum": 0}}
{"text": "I need more examples than what is presented in class.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 2, "sentnum": 1}}
{"text": "Also I need re-enforcement of “why” we might choose a statistical technique and “what” it means.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 2, "sentnum": 2}}
{"text": "We spent lots of time on “how”.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 2, "sentnum": 3}}
{"text": "I’m relying a lot on Khan academy to supplement what I’m missing in class.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 2, "sentnum": 4}}
{"text": "I do tend to learn slower than my peers", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 2, "sentnum": 5}}
{"text": "so maybe it’s me.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 2, "sentnum": 6}}
{"text": "Have you ever considered a separate lab?", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 2, "sentnum": 7}}
{"text": "There is never enough time for the R portion of the class.", "meta": {"filename": "201940SEIS631-01.txt", "linenum": 2, "sentnum": 8}}
{"text": "While Abe is one of the kindest professors I have had over the course of my undergraduate and MA programs previously, he struggles in the classroom.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 0, "sentnum": 0}}
{"text": "It is apparent he does not look at the slides before class.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 0, "sentnum": 1}}
{"text": "He cannot always solve the practice problems which the answers are provided on his instructor set of slides.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 0, "sentnum": 2}}
{"text": "When attempting to answer student questions, they are rarely resolved and often include the phrase \"google that.\"", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 0, "sentnum": 3}}
{"text": "He has admitted his primary coding language is python so he sometimes doesn't code right in R or will spend copious amounts of time talking about how you could code it in python when the class is about R. Abe also did not adequately prepare for the semester because he put up the syllabus and shared it with the bookstore, but on the first night of class realized he put the wrong copy of the book in the syllabus which many of us had already purchased.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 0, "sentnum": 4}}
{"text": "Luckily, you can get an e-edition for free if you choose to, but that is slightly unethical in my opinion so I double paid for the book.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 0, "sentnum": 5}}
{"text": "I think we spend too much class time on statistics and not enough on R. Make getting a book for R mandatory and assign reading.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 1, "sentnum": 0}}
{"text": "The trick for this class maybe is how to balance statistical concepts with R. Assign both homework from the book and R assignments.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 1, "sentnum": 1}}
{"text": "Some outside readings or examples of how the industry collect data, analyze data, and make statistical observations would be helpful to help us put the knowledge into work.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 1, "sentnum": 2}}
{"text": "Nothing is better than real world examples.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 1, "sentnum": 3}}
{"text": "Abe is a great communicator and professor.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 2, "sentnum": 0}}
{"text": "He has very deep knowledge of the subject as well as technical skills with R. He is fair with grading as well as providing an opportunity to recover some ground with extra-points with assignments and quizzes after not doing so well with the exam.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 2, "sentnum": 1}}
{"text": "He is open to getting feedback from his students in order to adjust and make sure students learn from his course.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 2, "sentnum": 2}}
{"text": "The course book we are using is good", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 2, "sentnum": 3}}
{"text": "but I feel that with Abe's background and qualifications, he can take that book, customize it, and make the course even better.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 2, "sentnum": 4}}
{"text": "I have no doubt that relying on the book's direction/path for the course would definitely suffice for what the course is trying to achieve but if it can be customized to fit the overall program would be even better.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 2, "sentnum": 5}}
{"text": "My only comment about the course (not on Abe particularly) is the use of the R language.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 2, "sentnum": 6}}
{"text": "I'm sure it is a great statistical software but I would have liked to use python with the course for the purpose of consistency, proficiency, and logical progression from requiring students to go through Python as a pre-requisite, taking the foundations in data analysis, machine-learning, up to the artificial intelligence course.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 2, "sentnum": 7}}
{"text": "I understand R or python (or any other software) are just tools and regardless of the tools used, the goal of the course is to gain knowledge and understanding in the foundations of statistics.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 2, "sentnum": 8}}
{"text": "However, I feel that proficiency in the use of the software by using it all through-out the program is just as important.", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 2, "sentnum": 9}}
{"text": "I think the big head-scratcher (at least for me) is why would the SEIS 631 course require SEIS 603 when python is not even used at all in SEIS631?", "meta": {"filename": "201940SEIS631-03.txt", "linenum": 2, "sentnum": 10}}
{"text": "Good teacher, appreciated the lectures greatly and appreciated his seeking feedback on course improvement.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 0, "sentnum": 0}}
{"text": "Hands on part of lecture was especially valuable.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 0, "sentnum": 1}}
{"text": "As an MBA student, this course was pretty difficult for me to understand.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 0}}
{"text": "Jumping right into Enterprise Miner was hard for me to grasp because it was pretty technical", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 1}}
{"text": "and I didn't really feel like I was getting the \"why\" behind using that platform.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 2}}
{"text": "I think using more real world applications each week with Enterprise Miner might have helped.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 3}}
{"text": "It got better as we went into Tableau as the handouts were a little easier to follow and it was a more intuitive platform.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 4}}
{"text": "I do think that final project helps tie things together and gives a better meaning to the course and why I took it.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 5}}
{"text": "I would also recommend reworking how the lectures are presented.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 6}}
{"text": "The handouts are definitely helpful, but I went through them again line by line after the lecture to help with the assignments.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 7}}
{"text": "So it seemed like a bit of a waste to spend half our class time going step by step through the handouts.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 8}}
{"text": "Maybe it would be more helpful to go over different examples than what's included in the handout.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 9}}
{"text": "Overall, I found myself enjoying the class more once we got to Tableau and I learned a lot through the final project and relating our classwork to a real world example.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 10}}
{"text": "Thanks for a great semester!", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 1, "sentnum": 11}}
{"text": "This course was comprised of two tools learning, one for data analytics and other for visualization.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 2, "sentnum": 0}}
{"text": "We have covered tableau much better than Enterprise miner.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 2, "sentnum": 1}}
{"text": "May be some more practical approach was missing in this course.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 2, "sentnum": 2}}
{"text": "Apart from Enterprise miner, there are many other data analytics tool which are better than it.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 2, "sentnum": 3}}
{"text": "We can include other tools as well.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 2, "sentnum": 4}}
{"text": "I have a lot of \"moderate progress\" as I have fairly substantial work history regarding this topic.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 3, "sentnum": 0}}
{"text": "However, the professor brings a large understanding, and passion to the subject matter.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 3, "sentnum": 1}}
{"text": "I've given my suggestion that the course material should be \"flipped\", but overall the course is meaningful for the average student, and with this professor, especially regarding the second half of the course.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 3, "sentnum": 2}}
{"text": "the professor relied heavy on information that was taught in another class.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 4, "sentnum": 0}}
{"text": "As someone who was from the MSA program, I felt like I was always trying to catch up and having to piece information together on my own.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 4, "sentnum": 1}}
{"text": "very kind and helping professor ever i have seen.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 5, "sentnum": 0}}
{"text": "Professor goes out of his way to help students learn in his class and to make them learn at their own pace with his guidance.", "meta": {"filename": "202040SEIS632-02.txt", "linenum": 6, "sentnum": 0}}
{"text": "I am not sure if this department even checks before they hire instructors anymore.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 0, "sentnum": 0}}
{"text": "I graduated from this program in the 90s when they had some fantastic instructors and came back to a grad certificate now.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 0, "sentnum": 1}}
{"text": "My first course was with Abe and it was a big disapointment.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 0, "sentnum": 2}}
{"text": "Knows nothing about what he is teaching and to over compensate acts too friendly", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 0, "sentnum": 3}}
{"text": "He's as articulate as a person with an accent but doesn't have an accent.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 1, "sentnum": 0}}
{"text": "And theres essay questions on the test.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 1, "sentnum": 1}}
{"text": "In an analytics class.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 1, "sentnum": 2}}
{"text": "Weird.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 1, "sentnum": 3}}
{"text": "His slides are a mess and hard to follow.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 1, "sentnum": 4}}
{"text": "I'd learn more if he huffed dry erase and did interpretive dance for 3 hours a week.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 1, "sentnum": 5}}
{"text": "Strange rictuals that the society/tribe make you go through.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 1, "sentnum": 6}}
{"text": "Weird.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 1, "sentnum": 7}}
{"text": "He discussed his research on presidential election data.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 2, "sentnum": 0}}
{"text": "Met him in his office.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 2, "sentnum": 1}}
{"text": "He tried to explain how everyone should be waiting democratic.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 2, "sentnum": 2}}
{"text": "I did not sign up for a lecture on politics.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 2, "sentnum": 3}}
{"text": "Weird.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 2, "sentnum": 4}}
{"text": "Abe is kind of a guy you would hire to baby sit your kids at home, overly friendly.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 3, "sentnum": 0}}
{"text": "However is a useless instructore.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 3, "sentnum": 1}}
{"text": "Lectures are unstructured, explanations are vague, irrelevant made up examples, and a worthless class project that everyone had to do.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 3, "sentnum": 2}}
{"text": "Talks about too many examples without even explaining them.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 4, "sentnum": 0}}
{"text": "You basically have to try and teach yourself with all the notes.", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 4, "sentnum": 1}}
{"text": "If u ask him a question, he always goes off topic and gives a vague answer that he is unsure about - something like \"yes sometimes that can happen although it depends I dont know that may not happen as well\" .", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 4, "sentnum": 2}}
{"text": "", "meta": {"filename": "201920SEIS632-rmp.txt", "linenum": 5, "sentnum": 0}}
{"text": "uses material from some other professor and it clearly shows that it is not his own.", "meta": {"filename": "201840SEIS632-rmp.txt", "linenum": 0, "sentnum": 0}}
{"text": "manyt imes unable to explain and replies with vagues answers.", "meta": {"filename": "201840SEIS632-rmp.txt", "linenum": 0, "sentnum": 1}}
{"text": "Friendly, approachable, smart, kind, and fair.", "meta": {"filename": "201840SEIS632-rmp.txt", "linenum": 1, "sentnum": 0}}
{"text": "Show up for class, ask for help if you need it, and you will succeed.", "meta": {"filename": "201840SEIS632-rmp.txt", "linenum": 1, "sentnum": 1}}
{"text": "Maybe find a textbook that only includes the language that is taught -- sometimes it was confusing when the information did not apply to oracle SQL.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 0, "sentnum": 0}}
{"text": "Maybe work more in livesql from the beginning.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 0, "sentnum": 1}}
{"text": "Just to get more comfortable actually programming.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 0, "sentnum": 2}}
{"text": "Thanks for keeping this course fresh and relevant, Abe", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 1, "sentnum": 0}}
{"text": "apply book chapter skills to the class project on a weekly basis like the quizes quizd us on the book knowleage.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 2, "sentnum": 0}}
{"text": "it would be more helpful to abosrb and retain the learning matrials.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 2, "sentnum": 1}}
{"text": "I would have liked to have more hands on coding and building during class rather than reviewing the reading as much as we had.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 3, "sentnum": 0}}
{"text": "Awesome course, awesome professor!", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 4, "sentnum": 0}}
{"text": "Abe is wonderful and I would take a course from him again.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 0}}
{"text": "He understands that we are all busy people, coming in with different backgrounds, and clearly worked hard to make sure we all learned something.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 1}}
{"text": "He was transparent that it was his first time teaching this course, and I could imagine a few changes to improve it.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 2}}
{"text": "I would have preferred that our weekly break out sessions were with a consistent group of people, so that we could have the opportunity to get to know our classmates better.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 3}}
{"text": "Depending on the combination of students, sometimes the break out room conversations were interesting, but I think that small group time would have been better served doing hands-on exercises together instead of discussing the textbook.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 4}}
{"text": "Actually, overall I wish there was much more hands-on work and less textbook review.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 5}}
{"text": "In our careers we need to have the skills more than we need to know the vocabulary.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 6}}
{"text": "If I didn't already know SQL I'm not sure I would have come away from this course being able to execute a medium complexity query, which I think should be a goal outcome.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 7}}
{"text": "I thought the final project was great, and the open-ended description allowed us all to choose our own adventure based on our interests and background knowledge.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 8}}
{"text": "I think we could have started the final project even earlier in the term and ideally had a round of feedback from Abe during the process.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 9}}
{"text": "The decision to have us prerecord the project presentations was truly brilliant.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 10}}
{"text": "Saved lots of presentation anxiety, potential for technical difficulties, and ensured (hopefully) that everyone comes in under 5 min! Abe utilized the virtual learning tools very well, I appreciated the organized Canvas course, the class announcements, and the discussions.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 11}}
{"text": "I thought it worked well to share with OneDrive even if students had a strangely hard time remembering to make the links actually be links!", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 12}}
{"text": "Next term, I'd suggest adding a short break or two during classes, letting us get to know our small groups, and reducing the percentage of lectures and increasing the amount of hands on exercises (all of these things would also encourage cameras on, since it would be less passive).", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 13}}
{"text": "Thanks for the course, Abe!", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 5, "sentnum": 14}}
{"text": "Abe is a great professor, clearly very knowledgeable about database management systems and design.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 6, "sentnum": 0}}
{"text": "He is able to explain complex topics in understandable terms and is always available to answer questions or provide feedback on assignments.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 6, "sentnum": 1}}
{"text": "One thing that I would have liked better about the course structure would be if we had started to design our model at the beginning of the semester and slowly add to it as we learned new topics week by week, rather than learning about all of the topics and then applying them in the last month of class.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 6, "sentnum": 2}}
{"text": "I also think that having randomized groups each week was good for meeting the majority of the classmates, however it may have been more beneficial to work with the same people each week and become more familiar with each other's project topics.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 6, "sentnum": 3}}
{"text": "Overall I really enjoyed this course and it provided a solid foundation for me to learn more in the field of database management systems.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 6, "sentnum": 4}}
{"text": "I would recommend Abe as a professor to anyone looking to take this course.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 6, "sentnum": 5}}
{"text": "Recommend having more practice SQL exercises for the class.", "meta": {"filename": "202120SEIS630-01.txt", "linenum": 7, "sentnum": 0}}
{"text": "The Assignments and Grading system is really good.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 0, "sentnum": 0}}
{"text": "It's more focused towards learning aspects rather then just the grading criteria.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 0, "sentnum": 1}}
{"text": "Good teaching methods by professor.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 0, "sentnum": 2}}
{"text": "His java background seem not that much great.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 1, "sentnum": 0}}
{"text": "I think he has good background in pythoton so its better assign mastered instructor for this course", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 1, "sentnum": 1}}
{"text": "Abe was well-informed in this area of study and did a great job focusing on the code itself as well as other peripheral information that enhances a student's knowledge about programming / computer science.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 2, "sentnum": 0}}
{"text": "There were some times in class when we dove deep into something that I didn't have questions on so it felt a little bit like an unnecessary use of class time.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 2, "sentnum": 1}}
{"text": "(3 evening hours every week is a long time away from my family and I want to always be getting high value return from that time)", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 2, "sentnum": 2}}
{"text": "But I suppose it was helpful to to hear others discuss the code/lecture and learn new perspectives in that way.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 2, "sentnum": 3}}
{"text": "The class structure was pretty good.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 3, "sentnum": 0}}
{"text": "I though it was a good choice to a final project over a final exam.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 3, "sentnum": 1}}
{"text": "The topics were interest although towards the end, the readings were somewhat long.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 3, "sentnum": 2}}
{"text": "The professor is good and responsible.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 4, "sentnum": 0}}
{"text": "I really appreciate Dr. Kazemzadeh's approach to this course and the topic material.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 5, "sentnum": 0}}
{"text": "I felt like there was a good balance between different types of evaluations (quizzes, videos, etc.).", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 5, "sentnum": 1}}
{"text": "Dr. Kazemzadeh was approachable and helpful in answering questions.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 5, "sentnum": 2}}
{"text": "I did enjoy the quizzes that we had to take.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 6, "sentnum": 0}}
{"text": "They weren't too easy or too difficult, but a good challenge to see where I am at.", "meta": {"filename": "202320SEIS601-01.txt", "linenum": 6, "sentnum": 1}}
{"text": "I like Abe's teaching style.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 0, "sentnum": 0}}
{"text": "There is a lot of emphasis on the slides during lecture, but that helps me because I don't think I'd retain the information by only reading it in a text book.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 0, "sentnum": 1}}
{"text": "He also does a good job pulling other students' professional experiences, which is very interesting to me and helps me see how this type of work is actually applied in current professional settings.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 0, "sentnum": 2}}
{"text": "More hands on SQL work would be really fun to add to the course.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 1, "sentnum": 0}}
{"text": "Aside from that I really liked the class and the teaching style of the professor.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 1, "sentnum": 1}}
{"text": "The freedom to choose a topic for the final project was excellent - even someone with a lot of database background (as I have) is able to move on to a new and interesting topic.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 2, "sentnum": 0}}
{"text": "Abe is great.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 3, "sentnum": 0}}
{"text": "he is really flexible with homework and tests, and is always open to questions.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 3, "sentnum": 1}}
{"text": "i really liked the project, we did it in steps instead of all at once, it made it easier to digest.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 3, "sentnum": 2}}
{"text": "he is also really understanding that when it comes to everyone being working adults, he really wants us to learn the material regardless of whether your homework answer is right or not, so i appreciate that way of grading.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 3, "sentnum": 3}}
{"text": "anyways, i hope to take a class with abe again.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 3, "sentnum": 4}}
{"text": "The course was a learning process for all.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 4, "sentnum": 0}}
{"text": "Every class needs to focus in providing students with projects to put on to github instead of exams.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 4, "sentnum": 1}}
{"text": "These are not english class we are trying build skill for.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 4, "sentnum": 2}}
{"text": "We need to be doing what we learn with regularity.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 4, "sentnum": 3}}
{"text": "I really liked the class.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 5, "sentnum": 0}}
{"text": "I would say that I was a beginning to low intermediate student when it came to databases.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 0}}
{"text": "I have a BS in computer science, but I don’t really interact with databases at a detail level in my career.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 1}}
{"text": "I think this course did a decent job of covering a wide array of database topics; maybe too wide.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 2}}
{"text": "So of the discussion on how to install various tools and applications that we did not actually wind up using seemed like a poor use of time.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 3}}
{"text": "There should have been much more homework, especially hands on work.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 4}}
{"text": "I felt like there was very little practice to learn from our mistakes.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 5}}
{"text": "The semester started out with a lot of hands-on work, jumping directly into doing a large volume of SQL statements.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 6}}
{"text": "I was enthused; it was actually FUN!", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 7}}
{"text": "We got immediate feedback with either being rewarded with a result of our query, or an error that we then needed to research and keep trying until it worked.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 8}}
{"text": "Later, as we were working through some very, very long chapters in the book, there was little hands on.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 9}}
{"text": "I feel like there should have been assignments for every class session.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 10}}
{"text": "The book was not exclusively, but highly focused on Microsoft SQL Server and not Oracle.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 11}}
{"text": "I get it that Oracle may be highly prominent in the industry and certainly a good employment skill for students, it was a bit frustrating to have a textbook that leaned towards MS and the work was 100% Oracle.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 12}}
{"text": "The breakout rooms did not seem very valuable to me, mainly because we did not always have a lot to talk about.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 13}}
{"text": "This brings me back to more frequent homework.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 14}}
{"text": "If we had assignments for each class, then the breakouts would have held more value to discuss the problems and outcomes.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 15}}
{"text": "Also, I think if we had more static breakout groups we would have grown together and been able to converse more.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 16}}
{"text": "Understand the value of mixing it up, so a compromise could be what I have had in other classes: 1 static group prior to midterm", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 17}}
{"text": "and then we get new teams for 2nd half of semester.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 18}}
{"text": "And to take that one step further, I think that it would have been really interesting if the final project was a team project.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 19}}
{"text": "This would have been more “real world” to create the problem solution as a team since that is how people would do it on the job.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 20}}
{"text": "Many of my other GPS classes have had team midterm and final projects.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 21}}
{"text": "It allows each person to use their strengths and learn from the others, especially with getting feedback.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 22}}
{"text": "“Hands On” segments at the end of class were really an instructor demo.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 23}}
{"text": "There was not the time, prepared instructions, or ability to multitask with watching what was happening in the demo and try to replicate it at the same time.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 24}}
{"text": "Plus they were always at the very end and we often went over the class end time.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 25}}
{"text": "This course, with 3 sections and lot of material, seems like it could be a good candidate for a Flipped Course format, with the lectures pre-recorded and the class sessions reserved for exercises, team work on projects, questions to the professor, etc.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 26}}
{"text": "It would certainly cut down on the need to repeat the lecture 3 nights a week.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 27}}
{"text": "Overall, I think this was a good course with challenging subject material and was a good showing for the professors first time teaching this class.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 6, "sentnum": 28}}
{"text": "I really learned a lot taking this class, I wasn't as big a fan of the textbook but I have really had my eyes opened to SQL and how useful it is", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 7, "sentnum": 0}}
{"text": "and It has already helped me out and work.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 7, "sentnum": 1}}
{"text": "Thanks Professor!", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 7, "sentnum": 2}}
{"text": "Professor has good skill sets for this course to explain and provides real example.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 8, "sentnum": 0}}
{"text": "If the professor could cover another SQL software for experimentation that would be helpful ( eg.", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 8, "sentnum": 1}}
{"text": "Microsoft SQL server management studio, MySQL, PostgreSQL).", "meta": {"filename": "202120SEIS630-03.txt", "linenum": 8, "sentnum": 2}}
{"text": "Great professor!", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 0, "sentnum": 0}}
{"text": "Very helpful and knowledgeable", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 0, "sentnum": 1}}
{"text": "Professor Abe has been excellent.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 1, "sentnum": 0}}
{"text": "I appreciate the impact this class has had on me professionally", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 1, "sentnum": 1}}
{"text": "This was his first time teaching the course so we all were learning the pace of the course with him.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 2, "sentnum": 0}}
{"text": "I enjoyed his flexibility and how he tries to engage with the students (despite how covid and zoom has been with students interacting).", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 2, "sentnum": 1}}
{"text": "I would say that overall he did a good job but I, personally, would've enjoyed more hands on work and less textbook reading and discussion of the textbooks.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 2, "sentnum": 2}}
{"text": "I think with databases, doing rather than reading, helps comprehend what everything does.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 2, "sentnum": 3}}
{"text": "Prior to taking this course I feel I had a very strong foundation for the content covered in Database Management Systems and Design, which was much different than many other individuals I found were taking the course.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 3, "sentnum": 0}}
{"text": "I thought Abe did an excellent job of catering to the differing levels of understanding and skillsets.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 3, "sentnum": 1}}
{"text": "The course followed a very meaningful sequence of concepts, and was delivered in a way that I felt everyone was set up for success.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 3, "sentnum": 2}}
{"text": "Too, I appreciated the time Abe put into sending weekly class emails, previews of the course content in modules, and giving enough information ahead of time so students who have responsibilities outside of class could really plan and stay on top of course content.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 3, "sentnum": 3}}
{"text": "Overall I was very pleased with my experience and the instruction I received.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 3, "sentnum": 4}}
{"text": "Professor Kazemzadeh is an incredibly thorough teacher.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 4, "sentnum": 0}}
{"text": "He is very in-depth the topics he teaches.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 4, "sentnum": 1}}
{"text": "While sometimes learning from him can be like trying to take a sip of water from a firehose, I do learn quite a bit.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 4, "sentnum": 2}}
{"text": "I believe that he does a good job of teaching to a diverse background of students.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 4, "sentnum": 3}}
{"text": "I would like more hands on activites, but I will always take Professor Kazemzadeh if he's available for a course I need to take.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 4, "sentnum": 4}}
{"text": "I think it would have helped if some of the assignments were more structured.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 5, "sentnum": 0}}
{"text": "That way it would be easier to see if we are making any mistakes after the answer key is published.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 5, "sentnum": 1}}
{"text": "I also think it would help if we were forced to use SQL more.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 5, "sentnum": 2}}
{"text": "More hands on activities or activities with quicker/instant feedback would be useful to judge understanding.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 6, "sentnum": 0}}
{"text": "Examples: Kahoot, more frequent/well defined assignments or mini-projects.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 6, "sentnum": 1}}
{"text": "I felt that the instructor did not have quite enough depth of knowledge to teach this course very effectively.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 7, "sentnum": 0}}
{"text": "Abe is very committed to helping his students; He seemed well-versed and I appreciate his attempts help the class engage with one another.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 8, "sentnum": 0}}
{"text": "I would have liked more Oracle assignments and hands-on activities (instead of demos by Prof Abe).", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 8, "sentnum": 1}}
{"text": "I think for what I paid for tuition, this was not worth the tuition paid.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 8, "sentnum": 2}}
{"text": "Assignments forced us to do things we barely learned in class, I ended learning more off Youtube than in class.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 8, "sentnum": 3}}
{"text": "Final project was a little all over the place (though the flexibility in topic was very appreciated) and not as organized as I think it could have been.", "meta": {"filename": "202120SEIS630-02.txt", "linenum": 8, "sentnum": 4}}
{"text": "Prof Abe is excellent in articulating concepts and very patient with students.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 0, "sentnum": 0}}
{"text": "I learned quite a lot useful knowledge that I can apply to my work and research.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 0, "sentnum": 1}}
{"text": "The course is trying to do too much in short time and there isn't enough time to full learn the subject before having to move on to next.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 1, "sentnum": 0}}
{"text": "No regular practice to make sure I grasp the concept until a test when I realize I didn't actually understand it.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 1, "sentnum": 1}}
{"text": "Great course.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 2, "sentnum": 0}}
{"text": "Learnt new things that making more competitive for data analysis.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 2, "sentnum": 1}}
{"text": "Sometime reading the book is hard and correlate with R seems little challenging.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 2, "sentnum": 2}}
{"text": "Definitely enjoying R Studio, RMarkdown and Github.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 2, "sentnum": 3}}
{"text": "Very patient and an overall a good prof.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 3, "sentnum": 0}}
{"text": "I think Abe could come more prepared to class to show examples from the book.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 4, "sentnum": 0}}
{"text": "Often it felt like he was walking through them for the first time while showing us.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 4, "sentnum": 1}}
{"text": "He understands the concepts, but at times it got lost while sorting through the problem.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 4, "sentnum": 2}}
{"text": "Also it felt broken between learning the statistical equations in the textbook versus R. I really enjoyed working in R and doing the problems in the textbook, I just wish there was more of a tie, it would help solidify concepts and theories and equations.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 4, "sentnum": 3}}
{"text": "It would be able to show R's capabilities and also be able to feel comfortable using it in everyday work situations.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 4, "sentnum": 4}}
{"text": "Right now I feel there's so much in R that we've gone over in class", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 4, "sentnum": 5}}
{"text": "but I don't know where or how to use it/explain it and then so much more that we never went over that could be relevant.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 4, "sentnum": 6}}
{"text": "I really enjoyed the homework format provided and learned a lot through them.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 5, "sentnum": 0}}
{"text": "Would love to have more homework that practically applies the readings in RStudio and have more questions to solve that would be similar to the assigned quizzes.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 5, "sentnum": 1}}
{"text": "I enjoyed the course quite a bit.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 6, "sentnum": 0}}
{"text": "I don’t have a stats background, but concepts and methods were understandable after having spent time with it.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 6, "sentnum": 1}}
{"text": "Professor is very understanding of the range in class stats knowledge and was fair in their creation and assessment of assignments, quizzes and exams.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 6, "sentnum": 2}}
{"text": "I liked that the final project gave us total creativity to explore a topic of our choice.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 6, "sentnum": 3}}
{"text": "I do think we could have used a bit more classroom breakouts to discuss the reading with fellow classmates.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 6, "sentnum": 4}}
{"text": "Since there were no group projects, it was a little harder trying to get to know my classmates.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 6, "sentnum": 5}}
{"text": "Surprisingly, more people turned their cameras on during breakouts than in the larger group.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 6, "sentnum": 6}}
{"text": "A few more smaller group settings could help for future courses.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 6, "sentnum": 7}}
{"text": "Overall, a really great course and kept my interest in statistics and R.", "meta": {"filename": "202220SEIS631-02.txt", "linenum": 6, "sentnum": 8}}
{"text": "The instructor does not always seem to know what he is doing or what he is talking about, especially when trying to show something in class or when someone asks a question.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 0, "sentnum": 0}}
{"text": "Professor Kazemzadeh organized the study material in a way it was quite easy to follow.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 1, "sentnum": 0}}
{"text": "When I started this course I was pretty novice", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 1, "sentnum": 1}}
{"text": "but I have learned a lot from this course.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 1, "sentnum": 2}}
{"text": "Thank you so much for offering such a wonderful class and great lectures.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 1, "sentnum": 3}}
{"text": "Prof. K is a great teacher.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 2, "sentnum": 0}}
{"text": "I truly appreciated his class and enjoyed learning from him.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 2, "sentnum": 1}}
{"text": "The most challenging aspect of the class was trying to have group discussions/participations.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 2, "sentnum": 2}}
{"text": "Discussions could be more structured or Prof. K. could call on others, to force people to engage more.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 2, "sentnum": 3}}
{"text": "I would rather work with my peers on a project than discuss the book readings...", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 2, "sentnum": 4}}
{"text": "it's just hard to have good class discussions late at night.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 2, "sentnum": 5}}
{"text": "All said and done, Prof. K is one of the better professors I've had this year.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 2, "sentnum": 6}}
{"text": "Truly enjoyed his class.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 2, "sentnum": 7}}
{"text": "It would have been helpful if there was 10-15 min time at the end for questions.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 3, "sentnum": 0}}
{"text": "Also, it would have been great if he gave breaks halfway during class and not towards the end.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 3, "sentnum": 1}}
{"text": "Some people haven't ate dinner yet.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 3, "sentnum": 2}}
{"text": "Overall, Abe is a great professor.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 3, "sentnum": 3}}
{"text": "good", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 4, "sentnum": 0}}
{"text": "came in with little to know knowlege on databases, glad i took this class.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 5, "sentnum": 0}}
{"text": "I can leave knowing that i have learned more than i expected to.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 5, "sentnum": 1}}
{"text": "Amazing Learning Experience", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 6, "sentnum": 0}}
{"text": "great", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 7, "sentnum": 0}}
{"text": "Really good course.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 8, "sentnum": 0}}
{"text": "Learned a lot more about database, especially about Oracle database.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 8, "sentnum": 1}}
{"text": "As someone who has prior knowledge of database, the class was a bit boring at times.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 9, "sentnum": 0}}
{"text": "However, professor Abe did great at sharing database experience and relevant modernized database information to give the class a better understanding.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 9, "sentnum": 1}}
{"text": "It was helpful when we used Oracle Developer to make the database.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 9, "sentnum": 2}}
{"text": "Prof. Abe is a very good person.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 10, "sentnum": 0}}
{"text": "As a teacher, he supports the students max.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 10, "sentnum": 1}}
{"text": "Overall good class and my only suggestion is that, classes could have been more interactive.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 10, "sentnum": 2}}
{"text": "Sometimes, I feel the interaction between the students and prof is less.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 10, "sentnum": 3}}
{"text": "Not all the times, but still some of the classes I felt so.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 10, "sentnum": 4}}
{"text": "Professor Abe is really friendly and kind.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 11, "sentnum": 0}}
{"text": "He would encourage people to ask questions and try to help as much as possible.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 11, "sentnum": 1}}
{"text": "He made me feel very comfortable asking question and just being in his class.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 11, "sentnum": 2}}
{"text": "However, his way of teaching is really boring ..", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 11, "sentnum": 3}}
{"text": "Abe is very responsive to questions and I can tell he has a lot of subject matter expertise.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 12, "sentnum": 0}}
{"text": "Abe's lecture style could be more engaging.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 12, "sentnum": 1}}
{"text": "I found his presentation skills a little disorganized and his thoughts hard to follow at times.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 12, "sentnum": 2}}
{"text": "Abe's grading is fair and overall, I'd say more hands-on SQL exercises would benefit students taking this course.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 12, "sentnum": 3}}
{"text": "Thank you for a great semester!", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 13, "sentnum": 0}}
{"text": "The information you have taught in this class have allowed me to advance further in my career and better understand how databases play into all aspects of our daily lives.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 13, "sentnum": 1}}
{"text": "Maybe have more activities for us to do on our own?", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 14, "sentnum": 0}}
{"text": "I feel like following along with what you did does ease the nervous feeling, but I also don't gain much confidence on I actually know the stuff.", "meta": {"filename": "202140SEIS630-02.txt", "linenum": 14, "sentnum": 1}}
{"text": "After reading all of the other reviews on here, I was really worried about this professor before taking his course, but trust me you have nothing to worry about.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 0, "sentnum": 0}}
{"text": "His lectures are a little dry, and he sometimes gets confused, but he is a great guy and the class isn't too hard.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 0, "sentnum": 1}}
{"text": "He is very receptive to feedback as well.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 0, "sentnum": 2}}
{"text": "Great class with a solid mixture of foundational database subjects from design to coding in SQL.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 1, "sentnum": 0}}
{"text": "Exercises from readings are done in Oracle.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 1, "sentnum": 1}}
{"text": "Reading is critical to this course.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 1, "sentnum": 2}}
{"text": "Professor mixes in relevant database happenings throughout lectures as well as created a steady build up to final project on database related subject student chooses.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 1, "sentnum": 3}}
{"text": "Abe is a great Professor.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 2, "sentnum": 0}}
{"text": "He is very helpful.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 2, "sentnum": 1}}
{"text": "It was my first database class and I did learn a lot of things from this class.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 2, "sentnum": 2}}
{"text": "We saw also some NoSql databases languages in the Class.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 2, "sentnum": 3}}
{"text": "Now, I am really good at the Oracle SQL.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 2, "sentnum": 4}}
{"text": "I also took from Java Foundation first from him.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 2, "sentnum": 5}}
{"text": "It was also great.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 2, "sentnum": 6}}
{"text": "I had Abe a year ago for a different class and thought his teaching style had improved quite a bit since then.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 3, "sentnum": 0}}
{"text": "One forever annoyance though is him spending class time to help individuals troubleshoot their database/program/etc.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 3, "sentnum": 1}}
{"text": "Sometimes he'll spend over an hour doing this!", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 3, "sentnum": 2}}
{"text": "Pretty good professor overall.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 4, "sentnum": 0}}
{"text": "Learned a lot about databases, SQL, and database management.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 4, "sentnum": 1}}
{"text": "Created my own hobby database on Oracle Cloud because I felt confident in my abilities from this class.", "meta": {"filename": "202330SEIS630_rmp.txt", "linenum": 4, "sentnum": 2}}
{"text": "Prof. Abe is an excellent instructor.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 0, "sentnum": 0}}
{"text": "The class content can be more engaging with in-class coding sessions along with slides.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 0, "sentnum": 1}}
{"text": "good", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 1, "sentnum": 0}}
{"text": "truly appreaviate professor for well organized and arragement for every class.\\great professor.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 2, "sentnum": 0}}
{"text": "Really enjoyed your teaching style.. the atmosphere you have created on the class really encouraged me to ask questions and explore more.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 3, "sentnum": 0}}
{"text": "This is coming from a person who is introvert (INFJ).", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 3, "sentnum": 1}}
{"text": "Last but not least, I have loved the jazz music you played in between the active sessions.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 3, "sentnum": 2}}
{"text": "Thank you, Abe!", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 3, "sentnum": 3}}
{"text": "Overall a good class experience and I enjoyed attending every class session.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 4, "sentnum": 0}}
{"text": "I would definitely find other courses with the same professor.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 4, "sentnum": 1}}
{"text": "One recommendation I would give is to have some type of fun online quiz game (ex: Quizizz.com) at the beginning of class rather than breakout discussion rooms.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 4, "sentnum": 2}}
{"text": "This would help students get a good recap of the terms or vocab of what was taught in the previous class session.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 4, "sentnum": 3}}
{"text": "It is obvious that Abe wants to teach the information in the class and that he wants us to succeed.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 0}}
{"text": "I also appreciate his honesty when not as sure on topics and is open to feedback from the class.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 1}}
{"text": "I understand sql is not a language that Abe is as comfortable with, but is always open for questions and willing to research on the spot.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 2}}
{"text": "I feel that the survey assignment was a create way to incorporate our data into creating tables and modifying tables.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 3}}
{"text": "I liked the concepts of the other assignments moving closer to the final project.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 4}}
{"text": "I appreciate the \"chose your own adventure\" final project approach.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 5}}
{"text": "I feel that this does give students more of an option to explore areas they are interested in.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 6}}
{"text": "There are a few areas in the class that I don't feel was as successful.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 7}}
{"text": "I am sure this is also different because online (which I took this section because it was offered online), but most of the members of my assigned breakout groups did not actually talk, work collaboratively, or even engage past the first group assignment.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 8}}
{"text": "I understand the goal of what the breakout groups was aiming for, but I don't think it was a productive use of time all of the time.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 9}}
{"text": "It may be nice to have a few more breaks.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 10}}
{"text": "Abe again is very eager to teach and share information with the class, but sometimes I think our brains need a few more short breaks.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 11}}
{"text": "Again, I enjoy being able to take my break at home because class is online, but could still use a few more bio / brain breaks.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 12}}
{"text": "I liked the hands on examples that were worked on in class, but maybe more of those examples could be integrated more in when going through the lecture part in the slides and looking at the book.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 13}}
{"text": "Sometimes it is helpful to break up the text a bit more too for tired brains.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 14}}
{"text": "Overall, the ratings I scored in this survey will seem low, but a large part of it is due to my level of comfort and experience with databases prior to class.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 15}}
{"text": "Thank you Abe for teaching this class and teaching it online!", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 5, "sentnum": 16}}
{"text": "The professor might not have field experience in this class.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 6, "sentnum": 0}}
{"text": "We rely more on the textbook and do not gain additional information further from that.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 6, "sentnum": 1}}
{"text": "Professor stumbles throughout the lesson and seems to be stumped by more in depth questions in class.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 6, "sentnum": 2}}
{"text": "I have gained more knowledge from going to youtube to understand how to do the assignments from my professor.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 6, "sentnum": 3}}
{"text": "The quizzes are more of a seek and find terminology from the text book than truly understanding the material.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 6, "sentnum": 4}}
{"text": "I was disappointed by this course.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 6, "sentnum": 5}}
{"text": "This might be better suited for an intro in the undergraduate level than for a master's course.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 6, "sentnum": 6}}
{"text": "I like the right speed in which Prof. Abe taught and the flexibility he provides where we can do a make up session with other day in the week.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 7, "sentnum": 0}}
{"text": "Had a very good experience and learned new theoretical and practical knowledge.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 7, "sentnum": 1}}
{"text": "Thank you Professor", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 7, "sentnum": 2}}
{"text": "I would appreciate more hands-on activity in class than lectures.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 8, "sentnum": 0}}
{"text": "I think having example of codes and walking through what it does and creating it would help with the learning process more.", "meta": {"filename": "202140SEIS630-03.txt", "linenum": 8, "sentnum": 1}}
{"text": "He is a good guy, responds quickly, and makes sure to take time to answer questions.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 0, "sentnum": 0}}
{"text": "He also goes out of his way to make sure people know what's expected for tests/assignments, and are following along.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 0, "sentnum": 1}}
{"text": "In general, his lectures are pretty dull and he lacks deep expertise about the subject.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 0, "sentnum": 2}}
{"text": "Thank you Professor!", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 1, "sentnum": 0}}
{"text": "Great course taught by a fantastic professor.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 2, "sentnum": 0}}
{"text": "Always very attentive and understanding.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 2, "sentnum": 1}}
{"text": "Highly recommended.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 2, "sentnum": 2}}
{"text": "Great teacher with lots of information.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 3, "sentnum": 0}}
{"text": "Course started off shaking in my opinion as I thought that it was just about SQL, but got more interesting as the course went on.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 3, "sentnum": 1}}
{"text": "I would maybe suggest using MS SQL, I think it is far superior to Oracle (Oracle Live was very glitchy for me), but I understand there maybe license issues", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 3, "sentnum": 2}}
{"text": "- Three hour lectures with one break was challenging to stay focused.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 4, "sentnum": 0}}
{"text": "Perhaps more frequent breaks might be helpful.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 4, "sentnum": 1}}
{"text": "It would have been helpful to have more focus on sql queries themselves for data preparation.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 5, "sentnum": 0}}
{"text": "Professor K. really cares about *_teaching_*", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 6, "sentnum": 0}}
{"text": "the subject matter.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 6, "sentnum": 1}}
{"text": "Unlike some professors, he seems like he wants his students to understand, rather than just perform.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 6, "sentnum": 2}}
{"text": "I'd definitely take another class with him again, if it fit my curriculum.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 6, "sentnum": 3}}
{"text": "Dr. Kazemzadeh is a very knowledgable and easygoing professor.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 7, "sentnum": 0}}
{"text": "He explains concepts in detail and is an approachable person outside of class hours.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 7, "sentnum": 1}}
{"text": "He is also very open to and encourages questions and discussion during the lecture.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 7, "sentnum": 2}}
{"text": "I also liked the structure of the course as I felt I was able to learn and succeed based on how we were evaluated.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 7, "sentnum": 3}}
{"text": "I experienced a positive learning experience and will apply the material from this course into my future endeavors.", "meta": {"filename": "202320SEIS630-01.txt", "linenum": 7, "sentnum": 4}}
{"text": "I feel so lucky to be one of members in Abe's class.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 0, "sentnum": 0}}
{"text": "Abe is a excellent professor who taught us in a interesting way with abundant knowledge.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 0, "sentnum": 1}}
{"text": "Far too often allowed the class to be taken aside by students to answer their specific technological questions, especially in the middle of lectures.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 1, "sentnum": 0}}
{"text": "These inopportune interruptions greatly diminished my learning experience, as I imagine it did for others as well.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 1, "sentnum": 1}}
{"text": "It does not help that there was no ability for Prof. Kazemzadeh's to give literal hands-on help to those students.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 1, "sentnum": 2}}
{"text": "This course does not work very well as an online synchronous class, perhaps online asynchronous would be better.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 1, "sentnum": 3}}
{"text": "I have no doubt in Prof. Kazemzadeh's expertise in the field, and given a normal semester, I believe I would have much better feedback to give.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 1, "sentnum": 4}}
{"text": "Abe is a wonderful human.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 2, "sentnum": 0}}
{"text": "He is the kind of person I would like to be friends with.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 2, "sentnum": 1}}
{"text": "However, he is hard to learn from.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 2, "sentnum": 2}}
{"text": "It feels as though he is either learning along with us or understands the material so well he struggles to break down the concepts.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 2, "sentnum": 3}}
{"text": "I do like him as a person though.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 2, "sentnum": 4}}
{"text": "Generally, this course is well designed for students who need to practice more in data analyses.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 3, "sentnum": 0}}
{"text": "The professor has extensive knowledge to lead the course and provides good examples.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 3, "sentnum": 1}}
{"text": "We have covered all topics from one book and solved the problems in it.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 4, "sentnum": 0}}
{"text": "The book has covered most of the topics nicely and we got all doubts cleared by professor.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 4, "sentnum": 1}}
{"text": "Thanks you !", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 4, "sentnum": 2}}
{"text": "I really liked this class.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 5, "sentnum": 0}}
{"text": "I liked the layout and learning from the different students.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 5, "sentnum": 1}}
{"text": "The breakout discussion groups helped me get to know my peers and that was useful for another class as we could have a study group.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 5, "sentnum": 2}}
{"text": "Overall, great job!", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 5, "sentnum": 3}}
{"text": "I really enjoyed this course!", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 6, "sentnum": 0}}
{"text": "I thought your assignments were an excellent way to learn the material.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 6, "sentnum": 1}}
{"text": "I appreciated the amount of time and effort he went to teach us R and make us comfortable with it.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 7, "sentnum": 0}}
{"text": "I also appreciated his flexibility with the assignments and exams so that we learn the concepts more.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 7, "sentnum": 1}}
{"text": "Professor is very passionate about teaching this course.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 8, "sentnum": 0}}
{"text": "He is very engaging and inspires me to work hard to learn as much as possible by internalizing the acquired knowledge.", "meta": {"filename": "202040SEIS631-03.txt", "linenum": 8, "sentnum": 1}}
{"text": "Great professor with a LOT of potential (on top of his current talents).", "meta": {"filename": "201920SEIS632-01.txt", "linenum": 0, "sentnum": 0}}
{"text": "He is very down to Earth and fair, and I am happy to have taken the course with him as the teacher.", "meta": {"filename": "201920SEIS632-01.txt", "linenum": 0, "sentnum": 1}}
{"text": "I look forward to seeing how his teaching methods produce the future of data-scientists!", "meta": {"filename": "201920SEIS632-01.txt", "linenum": 0, "sentnum": 2}}
{"text": "Abe is very knowledgeable however needs to work on his lecturing.", "meta": {"filename": "201920SEIS632-01.txt", "linenum": 1, "sentnum": 0}}
{"text": "The lectures are very dry and boring, and hard to listen to.", "meta": {"filename": "201920SEIS632-01.txt", "linenum": 1, "sentnum": 1}}
{"text": "The lectures were not very interactive, and some parts I had no idea why we were doing things, or what purpose certain tests served.", "meta": {"filename": "201920SEIS632-01.txt", "linenum": 1, "sentnum": 2}}
{"text": "The slides did not provide much info so was very hard to study from as well.", "meta": {"filename": "201920SEIS632-01.txt", "linenum": 1, "sentnum": 3}}
{"text": "I think with some practice and more interactiveness in the class instead of just sitting listening to lecture for 3 hours would help with the class to be more interesting.", "meta": {"filename": "201920SEIS632-01.txt", "linenum": 1, "sentnum": 4}}
{"text": "I learned a lot from this class.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 0, "sentnum": 0}}
{"text": "Lectures are long and it is too much information to digest.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 0, "sentnum": 1}}
{"text": "I think one thing that can improve this class is to organize/simplify the lectures to make it as easy as possible to understand/read.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 0, "sentnum": 2}}
{"text": "Maybe, even filter the information down to what is most important to know.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 0, "sentnum": 3}}
{"text": "I really gained a lot of useful skills/knowledge about creating visualizations and am very happy about that.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 1, "sentnum": 0}}
{"text": "I felt that the machine learning content was a little rushed, but understand the desire to have that as part of the course curriculum.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 1, "sentnum": 1}}
{"text": "Initially I though it would have been better to expand the time given to the machine learning part, but in retrospect, the visualization content is so useful that I wouldn't want to give it less time.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 1, "sentnum": 2}}
{"text": "I liked the individual projects a lot, but I think if they are individual projects we should probably present them as such rather than group presentations.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 1, "sentnum": 3}}
{"text": "One takeaway from our class presentation is we need a hard time limit and a timer to keep presentations from being too long.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 1, "sentnum": 4}}
{"text": "Wish we had spent more time on using Tableau and SAS Enterprise Miner to convey more statistical analysis related data.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 2, "sentnum": 0}}
{"text": "Also use Tableau to do table joins and other data cleansing and merging technics.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 2, "sentnum": 1}}
{"text": "Overall learned a lot from this course and the professor was incredibly generous with his time and put a lot of effort into making the course easy to understand.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 2, "sentnum": 2}}
{"text": "The course is too lengthy for the class duration.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 3, "sentnum": 0}}
{"text": "Practical lectures on SAS ERM or Tableau not both with the theory part.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 3, "sentnum": 1}}
{"text": "I think because of this issue the professor tried hard to make the course as smooth as possible.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 3, "sentnum": 2}}
{"text": "They're was too much that had to be covered in a 3 hour class, 70% of the classes weren't able to finish what was planned to be covered in them.", "meta": {"filename": "201920SEIS632-02.txt", "linenum": 3, "sentnum": 3}}
{"text": "Thank you Professor.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 0, "sentnum": 0}}
{"text": "I have learnt a lot.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 0, "sentnum": 1}}
{"text": "Abe is an incredibly nice person and has a good taste in music so this is hard to write.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 1, "sentnum": 0}}
{"text": "This course is very difficult to follow, when the topics are not.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 1, "sentnum": 1}}
{"text": "Organization is key to being able to follow an instructor and while you can tell Professor Kazemzadeh knows the topics inside and out, he struggles to relay them in a fashion that is easy to digest.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 1, "sentnum": 2}}
{"text": "Particularly, it would help if you start from a high level overview of what we are going to cover and what it is used for, before diving in and just going from step to step, waiting until the end to discuss the bigger picture.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 1, "sentnum": 3}}
{"text": "The layout of Canvas is also not the easiest to follow.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 1, "sentnum": 4}}
{"text": "Abe's most redeeming quality is that he cares about his students and is willing to take additional time to explain topics they may be struggling with.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 1, "sentnum": 5}}
{"text": "Overall I would likely give the course a C-.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 1, "sentnum": 6}}
{"text": "Most of what I learned I gathered from the book or online resources.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 1, "sentnum": 7}}
{"text": "Lecture was supplementary at best and sometimes was more confusing than it was helpful.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 1, "sentnum": 8}}
{"text": "I wish nothing but the best for Professor Kazemzadeh but a true reflection on how to present a lecture in an organized fashion, and probably a public speaking course, I believe would greatly benefit him and the course.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 1, "sentnum": 9}}
{"text": "N/A", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 2, "sentnum": 0}}
{"text": "I believe he is a fair teacher who listens to all when in class and tries to reach everyone by engaging conversation and examples.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 3, "sentnum": 0}}
{"text": "I enjoyed the class curriculum and I have definitely loved learning statistics through R.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 3, "sentnum": 1}}
{"text": "This class feels like two courses that were mashed together, but not mashed together well.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 4, "sentnum": 0}}
{"text": "There’s two subjects that we focus on R and statistics.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 4, "sentnum": 1}}
{"text": "I feel like we need to focus on one topic for the course to be more helpful or work with R more", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 4, "sentnum": 2}}
{"text": "Overall I really enjoyed this course and Abe did a really good job.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 5, "sentnum": 0}}
{"text": "He provided plenty of opportunity to grow, learn, and benefit from the material.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 5, "sentnum": 1}}
{"text": "He also provided plenty of opportunities to do well.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 5, "sentnum": 2}}
{"text": "And finally, he illustrated how the course material applied to real world problems and applications.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 5, "sentnum": 3}}
{"text": "Tougher material to teach.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 6, "sentnum": 0}}
{"text": "Bouncing between R and book was a bit rough.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 6, "sentnum": 1}}
{"text": "Not sure I feel great on either, but I could do it.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 6, "sentnum": 2}}
{"text": "It was a unique semester virtually with Covid.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 7, "sentnum": 0}}
{"text": "As a business student I thought I had a good understanding of statistics coming into class which was a strength but I am not as strong when it came to R as many of the other students who came from the school of engineering.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 7, "sentnum": 1}}
{"text": "Classmates may have had an upper hand with related experiences in python or other course work which a business student wouldn’t have.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 7, "sentnum": 2}}
{"text": "I sometimes fell behind during the online classes practicing r and between switching screens and it could be hard to do further functions if you missed something before.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 7, "sentnum": 3}}
{"text": "The text book was helpful when it came statistics related material but it didn’t have much direction on R, I wish maybe there was more writing or directions or another textbook to practice/learn R more outside off following along during class time.", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 7, "sentnum": 4}}
{"text": "Abe is very reasonable and it was great learning from him this semester, thank you!", "meta": {"filename": "202040SEIS631-01.txt", "linenum": 7, "sentnum": 5}}
{"text": "I like Abe a lot but sometimes the class feels very unorganized.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 0, "sentnum": 0}}
{"text": "Also, sometimes he doesn't have great time management and will spend way too much class time helping 1 or 2 people troubleshoot their problems.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 0, "sentnum": 1}}
{"text": "In the future he should really just tell people to talk to him after class instead of spending 30-60 minutes during class on it.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 0, "sentnum": 2}}
{"text": "He is a fair grader and very helpful", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 0, "sentnum": 3}}
{"text": "so I would definitely take another class from him again.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 0, "sentnum": 4}}
{"text": "Awesome professor, appreciated the flexibility and availability.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 1, "sentnum": 0}}
{"text": "the class is very slow.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 2, "sentnum": 0}}
{"text": "It might be nice to have more mandatory (graded, even just for completion) hands on assignments and projects throughout the semester.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 2, "sentnum": 1}}
{"text": "I think it'd be nice if a larger segment of class time was hands on projects and smaller segment being the lecturing.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 2, "sentnum": 2}}
{"text": "Not poorly taught, just far too easy and slow to be engaging.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 2, "sentnum": 3}}
{"text": "This was was amazing.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 3, "sentnum": 0}}
{"text": "Learned a lot.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 3, "sentnum": 1}}
{"text": "Thanks a lot professor!", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 3, "sentnum": 2}}
{"text": "I have learned many a things from your course.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 4, "sentnum": 0}}
{"text": "Thank you for your hardwork and for explaining concepts more clearly.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 4, "sentnum": 1}}
{"text": "I really appreciate it!", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 4, "sentnum": 2}}
{"text": "Thank you so much for your well prepared lectures.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 5, "sentnum": 0}}
{"text": "I always enjoy following your hand-on activity after each lecture and I appreciate how approachable you are.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 5, "sentnum": 1}}
{"text": "Professor Abe made class enjoyable since you can tell he is passionate about the subject.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 6, "sentnum": 0}}
{"text": "He provided ways to make the learning interactive and related it to real life events.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 6, "sentnum": 1}}
{"text": "Overall this class was very enjoyable and I learned alot more about oracle and other databases which will help in my current job!", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 6, "sentnum": 2}}
{"text": "Very knowledgeable and passionate about the subject taught.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 7, "sentnum": 0}}
{"text": "Real world examples and other topics were brought to class which helped showcase class related topics.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 7, "sentnum": 1}}
{"text": "It's evident that there is care and effort brought to every class and questions answered.", "meta": {"filename": "202320SEIS630-03.txt", "linenum": 7, "sentnum": 2}}
{"text": "I think having the hands-on activities at beginning of class helps ensure that we have enough time to get through the handouts, and also keeps attention better.", "meta": {"filename": "201940SEIS632-01.txt", "linenum": 0, "sentnum": 0}}
{"text": "I found the hands-on activities useful, especially Tableau.", "meta": {"filename": "201940SEIS632-01.txt", "linenum": 0, "sentnum": 1}}
{"text": "The lectures were too long.", "meta": {"filename": "201940SEIS632-01.txt", "linenum": 1, "sentnum": 0}}
{"text": "This is the first graduate level class I have taken at UST where the professor lectured the entire class for almost every class.", "meta": {"filename": "201940SEIS632-01.txt", "linenum": 1, "sentnum": 1}}
{"text": "That being said, Abe did a great job in his lectures using real-life examples and an easy-to-follow format.", "meta": {"filename": "201940SEIS632-01.txt", "linenum": 1, "sentnum": 2}}
{"text": "Consistent due dates each week on homework and quizzes would be very helpful in this class.", "meta": {"filename": "201940SEIS632-01.txt", "linenum": 1, "sentnum": 3}}
{"text": "Enterprise Minor is a difficult software to use and I commend Abe's efforts on teaching us in this software.", "meta": {"filename": "201940SEIS632-01.txt", "linenum": 1, "sentnum": 4}}
{"text": "It would be great if UST could find a software that is more widely-used and easier to use for this class (I would have been willing to pay money to use better software).", "meta": {"filename": "201940SEIS632-01.txt", "linenum": 1, "sentnum": 5}}
{"text": "This course is highly disorganized, and the structure of the final project seems nearly useless for evaluating student learning, as it depends too significantly on the process of finding and organizing a meaningful data set rather than the analytics and visualization of the title.", "meta": {"filename": "201940SEIS632-01.txt", "linenum": 2, "sentnum": 0}}
{"text": "I don't feel this class meaningfully prepared me to use the technology, or to understand the concepts, as too much time was spent acquiring usable data.", "meta": {"filename": "201940SEIS632-01.txt", "linenum": 2, "sentnum": 1}}
{"text": "I really liked his teaching approach.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 0, "sentnum": 0}}
{"text": "He takes attention to what his students suggest and also checks if the students understood what he taught.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 0, "sentnum": 1}}
{"text": "He is also a nice human being.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 0, "sentnum": 2}}
{"text": "Prof Abe is great.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 1, "sentnum": 0}}
{"text": "He taught us many statistics knowledge, used many latest dataset during our class, adapted flip teaching method.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 1, "sentnum": 1}}
{"text": "He is very nice, and professional for any questions from student.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 1, "sentnum": 2}}
{"text": "Thanks Abe", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 1, "sentnum": 3}}
{"text": "Adapted very well to the challenges of transitioning to online learning, encouraged participation and was always open and responsive to questions.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 2, "sentnum": 0}}
{"text": "Sought out his section for a future registered class because his style works well for me and I appreciate his dedication.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 2, "sentnum": 1}}
{"text": "Great first class and professor to have for my program.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 2, "sentnum": 2}}
{"text": "This course was difficult to follow along with as the tests and lectures didn't seem to correspond with the homework.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 3, "sentnum": 0}}
{"text": "Alot of the work we did that was graded was not what we were tested on which led to a lot of confusion and many adjustments after the tests were graded.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 3, "sentnum": 1}}
{"text": "I felt the communication was a little lacking as much as of it wasn't available on canvas and was done through the lectures which made it hard to reference back to.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 3, "sentnum": 2}}
{"text": "I think our professor was knowledgable and super nice but that the class as a whole had to drive most of the discussion and routinely ask for clarification on each assignment and each topic.", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 3, "sentnum": 3}}
{"text": "Abe is very friendly, understanding and knowledgeable!", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 4, "sentnum": 0}}
{"text": "I enjoyed this class alot even during COVID-19!", "meta": {"filename": "202020SEIS631-02.txt", "linenum": 4, "sentnum": 1}}
{"text": "Given the difficulty of transitioning to distance learning, I think this class went well.", "meta": {"filename": "202020SEIS631-01.txt", "linenum": 0, "sentnum": 0}}
{"text": "I found the flipped lecture format to be surprisingly effective.", "meta": {"filename": "202020SEIS631-01.txt", "linenum": 0, "sentnum": 1}}
{"text": "This was one of the best classes I ever took.", "meta": {"filename": "202020SEIS631-01.txt", "linenum": 1, "sentnum": 0}}
{"text": "professor Abe is one of the best I ever learned from.", "meta": {"filename": "202020SEIS631-01.txt", "linenum": 1, "sentnum": 1}}
{"text": "He is humble and eager to teach no matter how long or hard it took teach me.", "meta": {"filename": "202020SEIS631-01.txt", "linenum": 1, "sentnum": 2}}
{"text": "I would ask him questions and he would stay almost for another hour helping me out.", "meta": {"filename": "202020SEIS631-01.txt", "linenum": 1, "sentnum": 3}}
{"text": "I would definitely recommend students to take his classes.", "meta": {"filename": "202020SEIS631-01.txt", "linenum": 1, "sentnum": 4}}
{"text": "Passive aggressive, did not help, told me I would fail the class without giving any solution.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 0, "sentnum": 0}}
{"text": "Was lost during class.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 0, "sentnum": 1}}
{"text": "You should not take this class.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 0, "sentnum": 2}}
{"text": "I say it for your own good.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 0, "sentnum": 3}}
{"text": "Avoid at all costs.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 1, "sentnum": 0}}
{"text": "Abe seems like a nice guy, but you will teach yourself everything in this course, he confuses himself.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 1, "sentnum": 1}}
{"text": "He stumbles and stutters through topics.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 1, "sentnum": 2}}
{"text": "You can do the reading, read through the slides, and then get to class and he will take everything you learned and throw it out the window.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 1, "sentnum": 3}}
{"text": "Worthless.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 1, "sentnum": 4}}
{"text": "Do not recommend!", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 2, "sentnum": 0}}
{"text": "This professor does not care about you learning the material.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 2, "sentnum": 1}}
{"text": "The lectures did not match up with what was needed for the exams.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 2, "sentnum": 2}}
{"text": "Take this class from Professor Ann instead.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 2, "sentnum": 3}}
{"text": "I have heard she is good.", "meta": {"filename": "202040SEIS631-rmp.txt", "linenum": 2, "sentnum": 4}}
{"text": "A decent course, with interesting material, but having a professor (Kazemzadeh) teach from another professor's (Rege) materials and slides seemed ineffective.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 0, "sentnum": 0}}
{"text": "The lack of a course text, or something more concrete to follow lead to confusion at times in knowing what was pertinent.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 0, "sentnum": 1}}
{"text": "I don't feel like any one topic was covered in-depth, and only gained a surface-level understanding of some things.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 0, "sentnum": 2}}
{"text": "Thank you for making yourself so available outside of class!", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 1, "sentnum": 0}}
{"text": "I think this overall course was good, I think that if the professor had his own slides for the course it would have been better for our learn purposes, using course material that the other professor had made it harder on him as a professor but also us as students.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 2, "sentnum": 0}}
{"text": "I think over time with his understanding of the material he will get more comfortable.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 2, "sentnum": 1}}
{"text": "I think that there should be a pre-requisite for this class that students need to completed OPMT-600 (Stat Methods for Dec Making) before being able to take this class.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 3, "sentnum": 0}}
{"text": "I am also taking the stats class in addition to this class, but much of what is taught in the second part of the semester in the stats class is the foundation for all the math related to the analytics part in the first half of the semester for this class.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 3, "sentnum": 1}}
{"text": "That was a major struggle.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 3, "sentnum": 2}}
{"text": "Great effort for a first course at St. Thomas.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 4, "sentnum": 0}}
{"text": "Thanks for trying hard!", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 4, "sentnum": 1}}
{"text": "This course is does not meet the level of graduate school.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 5, "sentnum": 0}}
{"text": "I felt it was a basic introductory class that should have been a prerequisite for a class that took the time to explore the concepts in better detail.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 5, "sentnum": 1}}
{"text": "He has a great knowledge and experience in his field, and has got very good personality and is always willing to help students.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 6, "sentnum": 0}}
{"text": "He will continue to explain things until the student understand the material.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 6, "sentnum": 1}}
{"text": "He makes him self available to students even after class hours.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 6, "sentnum": 2}}
{"text": "I had stopped by at his office many times this semester when I had questions.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 6, "sentnum": 3}}
{"text": "He is always accepting and willing to help students.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 6, "sentnum": 4}}
{"text": "Abe is a great professor.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 6, "sentnum": 5}}
{"text": "Lecture slides have very little dialogue to refer back to.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 7, "sentnum": 0}}
{"text": "The only way to study material presented by Dr. Kazemzadeh was to be a fast writer taking good notes or reviewing the 3 hours lectures that were recorded.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 7, "sentnum": 1}}
{"text": "I would prefer the lecture slides gave more dialogue and there was a course textbook as an assistive aid.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 7, "sentnum": 2}}
{"text": "Dr. Kazemzadeh shows that he is passionate about data analytics and visualization and wants everyone he is teaching to understand the topics.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 7, "sentnum": 3}}
{"text": "His style of presenting the information is not well suited for my learning style.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 7, "sentnum": 4}}
{"text": "I wish we would have done more hands-on practice with visualization as I felt we spent too much time looking at visualizations - it felt redundant.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 7, "sentnum": 5}}
{"text": "I think it would help to have a specific set of data that students use throughout the analytics and visualization portions of the course to get a more full understanding of the lifespan of a data analytic process with one set of data.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 0}}
{"text": "Also, I don't really have any insights as to how to correct this, but I put at least 20 hours into preparing for the midterm and at least 20 hours preparing for the final and came out of both feeling utterly dejected.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 1}}
{"text": "It was frustrating to put that much effort into studying and still feel like (a) you don't understand what is expected of you on the exam and (b) to feel like you have a good grasp on the topics going into the exam and coming out feeling like you know nothing.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 2}}
{"text": "I know we had study guide slides, but those simply truncated the slides from the course.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 3}}
{"text": "Maybe more in class (or take home) practice problems that better prepare us for what to expect on the midterm, at the very least to prepare for the formatting of the exam.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 4}}
{"text": "Lastly, I am in the business analytics program and have no analytic or visualization background; I am interested in the subject and broaching that field for work, which is why I enrolled in the program.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 5}}
{"text": "At times in this class I really felt like this was a handicap and that we were working off an assumption of knowledge that I did not have.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 6}}
{"text": "I don't mean the above statements to come off as complaining or whining, just merely conveying some of the speed bumps I encountered this semester.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 7}}
{"text": "Overall, I really enjoyed the topics covered in class and felt like I gained some great experience using tools I have never used before.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 8}}
{"text": "You clearly have a strong command of the topics and I really enjoyed your style of teaching, I felt you were very helpful and approachable.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 9}}
{"text": "Thank you for a good semester.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 10}}
{"text": "All the best.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 8, "sentnum": 11}}
{"text": "Overall, I think St. Thomas could have provided more mentoring to Ebrahim, since this was his first term teaching.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 9, "sentnum": 0}}
{"text": "I feel like the feedback provided to him midpoint in the semester was not applied for the rest of the semester.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 9, "sentnum": 1}}
{"text": "I think he has a lot of great insight to bring to this class, but needs to become more comfortable leading the class.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 9, "sentnum": 2}}
{"text": "His class engagement skills could be improved.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 9, "sentnum": 3}}
{"text": "I would recommend Dale Carnegie: High Impact Presentation Course for this.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 9, "sentnum": 4}}
{"text": "I've been disappointed with this course and feel that I did not learn valuable information that I can take and apply.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 9, "sentnum": 5}}
{"text": "Instead, it has felt like a waste of time and money.", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 9, "sentnum": 6}}
{"text": "It would be nice to try to keep the in-class discussion focused and concise (more from the students than from Abe)", "meta": {"filename": "201840SEIS632-01.txt", "linenum": 10, "sentnum": 0}}
{"text": "OMG!!", "meta": {"filename": "202020SEIS632-rmp.txt", "linenum": 0, "sentnum": 0}}
{"text": "I regret I took his class.", "meta": {"filename": "202020SEIS632-rmp.txt", "linenum": 0, "sentnum": 1}}
{"text": "Lectures are nothing like what is on the test.", "meta": {"filename": "202020SEIS632-rmp.txt", "linenum": 0, "sentnum": 2}}
{"text": "He is all over the place all the time.", "meta": {"filename": "202020SEIS632-rmp.txt", "linenum": 0, "sentnum": 3}}
{"text": "He is very unclear in his explanation.", "meta": {"filename": "202020SEIS632-rmp.txt", "linenum": 0, "sentnum": 4}}
{"text": "Really good course.", "meta": {"filename": "202240SEIS630-01.txt", "linenum": 0, "sentnum": 0}}
{"text": "I like the exercises and the use of homework, project and quizes vs. final exam.", "meta": {"filename": "202240SEIS630-01.txt", "linenum": 0, "sentnum": 1}}
{"text": "I actually would have like more homework with specific use cases (build a database to meet this need, etc.)", "meta": {"filename": "202240SEIS630-01.txt", "linenum": 0, "sentnum": 2}}
{"text": "The ability to inform and state clearly that Oracle taught in class would be a little different from other Database Management systems and showing use cases was eye-opening.", "meta": {"filename": "202240SEIS630-01.txt", "linenum": 1, "sentnum": 0}}
{"text": "Great lecture and progress made understanding databases and their systems.", "meta": {"filename": "202240SEIS630-01.txt", "linenum": 1, "sentnum": 1}}
{"text": "I learned few new topics from this class and everything was good!", "meta": {"filename": "202240SEIS630-01.txt", "linenum": 2, "sentnum": 0}}
{"text": "Great guy, but not the best at explaining database concepts.", "meta": {"filename": "202240SEIS630-01.txt", "linenum": 3, "sentnum": 0}}
{"text": "Using more plain language to explain difficult concepts would be helpful, as well as more examples and writing more on the board to provide visual examples.", "meta": {"filename": "202240SEIS630-01.txt", "linenum": 3, "sentnum": 1}}
{"text": "The Venn diagrams and normalization exercise were great, and I think he should do more of them!", "meta": {"filename": "202240SEIS630-01.txt", "linenum": 3, "sentnum": 2}}
{"text": "The class is interactive and the gentle introduction of new topics helped both experienced and new students to the subject to progress with ease.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 0, "sentnum": 0}}
{"text": "You may wish to introduce more group assignments earlier on in the course, if it is possible.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 0, "sentnum": 1}}
{"text": "Your patience with everyone was awesome.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 0, "sentnum": 2}}
{"text": "Thank you.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 0, "sentnum": 3}}
{"text": "loved the way of teaching, group discussions.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 1, "sentnum": 0}}
{"text": "Overall enjoyed the course!!", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 1, "sentnum": 1}}
{"text": "For future semesters, it may be helpful to pare down the readings a bit, or highlight the most important sections of a reading beforehand.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 2, "sentnum": 0}}
{"text": "In lecture, it often felt like it took too long to get us into the material.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 2, "sentnum": 1}}
{"text": "Getting into the material quicker could give more hands-on time and activities, which would be very appreciated.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 2, "sentnum": 2}}
{"text": "I thought the course was really helpful in terms of understanding concepts better and applying them in the actual sql queries because of the final project where we put all the concepts in on thing, so we could see how to use the data modeler to create the diagrams and then using either LiveSQL or the live class database to display our data to our classmates, it really helped knowing how to actual see how everything we learned applyed to real life.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 3, "sentnum": 0}}
{"text": "Great course and instructor.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 4, "sentnum": 0}}
{"text": "Hopefully I am able to take more classes with Professor Kazemzadeh.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 4, "sentnum": 1}}
{"text": "My progress was made evident with the final project, where I surprised myself developing my own DBMS.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 4, "sentnum": 2}}
{"text": "Professor was exceptional in knowledge and teaching.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 4, "sentnum": 3}}
{"text": "Should concentrate more time on introducing the materials than reviewing the homework.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 5, "sentnum": 0}}
{"text": "We could explore the topics more rather than learn them by ourselves.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 5, "sentnum": 1}}
{"text": "Reading should be shorter.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 5, "sentnum": 2}}
{"text": "Reading takes a lot of time and sometimes I end up giving it up.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 5, "sentnum": 3}}
{"text": "The professor was amazing and very informative.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 6, "sentnum": 0}}
{"text": "Really made foreign topics easy.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 6, "sentnum": 1}}
{"text": "Amazing teacher and methods, difficult subject matter to wrap head around with busy schedule and zero prior experience.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 7, "sentnum": 0}}
{"text": "Overall, this has been a great class for someone who had no database knowledge/experience.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 8, "sentnum": 0}}
{"text": "The workload is manageable and the professor does an excellent job.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 8, "sentnum": 1}}
{"text": "You did a very good job with teaching.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 9, "sentnum": 0}}
{"text": "I also love that we could approach you when we had issues.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 9, "sentnum": 1}}
{"text": "Thank you!", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 9, "sentnum": 2}}
{"text": "It was a great learning experience taking thi course.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 10, "sentnum": 0}}
{"text": "Professor Abe is a great instructor", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 11, "sentnum": 0}}
{"text": "and I felt I learnt a lot this semester.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 11, "sentnum": 1}}
{"text": "The course was extremely interesting and the instructor is clearly knowledgeable, approachable and focuses more on practical things.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 11, "sentnum": 2}}
{"text": "Definitely I would put my effort in reading the course material earlier to class as per the ask but I would expect him to teach the basics too in the class.", "meta": {"filename": "202240SEIS630-03.txt", "linenum": 11, "sentnum": 3}}
{"text": "This prof is super passive aggressive, even more passive aggressive than me positing this here anonymously!", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 0, "sentnum": 0}}
{"text": "I don't recommend!", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 0, "sentnum": 1}}
{"text": "He is fine for chit chatting after class.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 1, "sentnum": 0}}
{"text": "Really awful as far as teaching is concerned.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 1, "sentnum": 1}}
{"text": "Dont even ask him questions.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 1, "sentnum": 2}}
{"text": "He makes up some random answers that are completely wrong.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 1, "sentnum": 3}}
{"text": "first time teaching this course", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 2, "sentnum": 0}}
{"text": "and it showed.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 2, "sentnum": 1}}
{"text": "class had a wide range of knowledge which may have created the environment i was in but man was it a slog to get through.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 2, "sentnum": 2}}
{"text": "quizzes were based off the book.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 2, "sentnum": 3}}
{"text": "focusing on reading a book and not require any hands on work for the most part is not what a database class should be.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 2, "sentnum": 4}}
{"text": "i didn't learn much.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 2, "sentnum": 5}}
{"text": "If u ask him about video editing or boat sailing, he will passionately chat with u. U ask him anything from the course and he has no answer.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 3, "sentnum": 0}}
{"text": "So I asked this guy difference between transactions in RDBMS and NoSQL systems.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 3, "sentnum": 1}}
{"text": "His reply was \"every database company is different and you should call their customer support to know the differences\".", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 3, "sentnum": 2}}
{"text": "LOL :)", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 3, "sentnum": 3}}
{"text": "Does not know anything beyond the powerpoint slides he reads through.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 4, "sentnum": 0}}
{"text": "Even those slides are some other professors and not his own so clearly he has no idea.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 4, "sentnum": 1}}
{"text": "Moreover, during my office hour questions he used to google search for answers and asked me to do the same.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 4, "sentnum": 2}}
{"text": "He uses his slides of other professors and reads through.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 5, "sentnum": 0}}
{"text": "If you ask a question he almost never knows the answers and gives a very vague tangential rant.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 5, "sentnum": 1}}
{"text": "Boring as hell.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 5, "sentnum": 2}}
{"text": "I am not learning anything from Abe.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 5, "sentnum": 3}}
{"text": "He tries to act nice and he might be nice but that doesnt help.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 5, "sentnum": 4}}
{"text": "Waste.", "meta": {"filename": "202120SEIS630-rmp.txt", "linenum": 5, "sentnum": 5}}
{"text": "Knowledgeable about the subject and makes class interesting.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 0, "sentnum": 0}}
{"text": "I would like to say thanks to the professor that he has given us good knowledge about this course.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 1, "sentnum": 0}}
{"text": "Thank you so much, professor.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 1, "sentnum": 1}}
{"text": "There probably should have been more assignments or quizzes.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 2, "sentnum": 0}}
{"text": "Having one bad day/week can cost a lot.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 2, "sentnum": 1}}
{"text": "Better preparation for more fluid classes.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 3, "sentnum": 0}}
{"text": "Less time spent on tangents, more on the material.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 3, "sentnum": 1}}
{"text": "Time wasted at the beginning of class is mostly unnecessary.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 3, "sentnum": 2}}
{"text": "Professor is excellent.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 4, "sentnum": 0}}
{"text": "I would recommend the class with Abe anytime.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 4, "sentnum": 1}}
{"text": "I enjoyed this course, although there were many times that the professor spent too long trying to answer one student's individual question instead of requesting them to attend office hours.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 5, "sentnum": 0}}
{"text": "This meant that we frequently didn't finish lectures or get to dive into the hands on activity.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 5, "sentnum": 1}}
{"text": "N/A", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 6, "sentnum": 0}}
{"text": "Prof. Abe is an excellent teacher.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 7, "sentnum": 0}}
{"text": "He is very kind and approachable person with great subject knowledge.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 7, "sentnum": 1}}
{"text": "He is gem of a person.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 7, "sentnum": 2}}
{"text": "Thank for teaching us!", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 7, "sentnum": 3}}
{"text": "Professor Kazemzadeh is definitely knowledgeable in this subject, however he might make a better professor for undergraduate versus graduate level students.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 8, "sentnum": 0}}
{"text": "While he's very nice and patient and takes the time to listen to students, often he will get distracted and go on a tangent about something that is deeper than where we are in the class/level of understanding for most students.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 8, "sentnum": 1}}
{"text": "This then creates a ripple effect where class goes past 9pm which can be frustrating since most of us work full time jobs prior to class, it's important to respect our time as well and end class as scheduled.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 8, "sentnum": 2}}
{"text": "he in class hands-on activities also seem unstructured and in the end don't prepare us for the homework/final project.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 8, "sentnum": 3}}
{"text": "I think the class needs a better balance of lecture versus hands-on activities rather than just rushing through it at the end of class.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 8, "sentnum": 4}}
{"text": "We spent more time doing work in OracleDataModeler in one class than it felt like we did of database creation/querying, even though Professor kept saying it's more important to be comfortable and capable querying than building models, I felt we could have gotten deeper on writing complex queries which would be more beneficial.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 8, "sentnum": 5}}
{"text": "The Professor has very good hands-on knowledge of the database.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 9, "sentnum": 0}}
{"text": "His practical examples helped us understand the concepts.", "meta": {"filename": "202220SEIS630-01.txt", "linenum": 9, "sentnum": 1}}
{"text": "I like your commitment towards the course.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 0, "sentnum": 0}}
{"text": "your feedback are more energetic and motivating me to do more.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 0, "sentnum": 1}}
{"text": "And your assignments on real time scenarios are excellent.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 0, "sentnum": 2}}
{"text": "please accept my deepest thanks.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 0, "sentnum": 3}}
{"text": "All the best.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 0, "sentnum": 4}}
{"text": "The software for the most important part the ANALYTICS is outdated, not asked about in interviews or wanted on job boards.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 1, "sentnum": 0}}
{"text": "The tableau was not deep enough to make any difference in getting a job the data was too small to say you figured anything out.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 1, "sentnum": 1}}
{"text": "The prof is smart and could be teaching a class that is useful as a data scientist that would help us get a job.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 1, "sentnum": 2}}
{"text": "This class was a waste of my money and as a for-profit college trying to teach something you have failed again.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 1, "sentnum": 3}}
{"text": "I still have not learned Analytics I need for a job interview or to help me keep up with other students that chose much better schools.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 1, "sentnum": 4}}
{"text": "Honestly, I was disappointed in the course.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 0}}
{"text": "I was hoping to have more hands-on learning and real-world application of data analytics and visualization topics.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 1}}
{"text": "Need to go through the in-class hands-on exercises in SAS EM and Tableau slower.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 2}}
{"text": "I got lost a few times and had a hard time catching up.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 3}}
{"text": "Also, I wished there would have been more exercises/assignments using Tableau.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 4}}
{"text": "I feel that I could have learned more about Tableau by reading a book and working through exercises on my own.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 5}}
{"text": "The data analytics portion should be taught using R instead of SAS as I feel R is more of a marketable skill than SAS EM is.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 6}}
{"text": "The two parts of the class (analytics and visualization) should be broken out into separate classes in order to go more in depth.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 7}}
{"text": "It was difficult to be engaged during the class lectures.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 8}}
{"text": "Maybe it's part of being in the Saturday class but, especially by the afternoon, it was hard to just sit and listen and look at lecture slides.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 9}}
{"text": "There was a lot of conceptual material, which was helpful, but terms weren't adequately defined which made it difficult to learn and comprehend.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 10}}
{"text": "There needed to be more of a hands-on component.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 11}}
{"text": "Finally, I think the ethics of using student midterm data including individuals' demographic data for the final project is questionable.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 2, "sentnum": 12}}
{"text": "He's a good professor but the way to deliver the lecture is not good.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 3, "sentnum": 0}}
{"text": "Just running through the slides.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 3, "sentnum": 1}}
{"text": "About the course itself, It emphasis more on theoretical than practical.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 3, "sentnum": 2}}
{"text": "For the Visualization It didn't focus more on practical approach.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 3, "sentnum": 3}}
{"text": "Abe is new to teaching.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 4, "sentnum": 0}}
{"text": "I think he was definitely more better with the videos and the lectures second half of the semester.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 4, "sentnum": 1}}
{"text": "I liked his videos rather than the handouts.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 4, "sentnum": 2}}
{"text": "Very helpful and passionate about the Data Analytics which definitely helped.", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 4, "sentnum": 3}}
{"text": "Very helpful and very willing to assist.~", "meta": {"filename": "201840SEIS632-04.txt", "linenum": 5, "sentnum": 0}}
{"text": "I really enjoyed learning from Abe this semester.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 0, "sentnum": 0}}
{"text": "It is very, very clear that he has a wealth of knowledge both on the direct subject matter of databases but also just software engineering as a whole.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 0, "sentnum": 1}}
{"text": "Abe is always willing to spend extra time answering questions for students and going over difficult topics.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 0, "sentnum": 2}}
{"text": "I think the only issue I would have with Abe is that occasionally class ends up going long, and normally only by 5-10 minutes but when class is already 3 hours long and ending at 9 PM, it would be highly preferred to always end on time.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 0, "sentnum": 3}}
{"text": "The times it has been the most frustrating is when going over the homework that is due the next week and spending excess time talking though it instead of letting the student(s) do the homework on their own.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 0, "sentnum": 4}}
{"text": "Overall, I think Abe is a great professor and I really enjoyed him.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 0, "sentnum": 5}}
{"text": "Thanks for presenting us this class throughout the semester, prof.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 1, "sentnum": 0}}
{"text": "Abe!", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 1, "sentnum": 1}}
{"text": "Excellent teaching, Professor was always helpful, always made the class interactive though class was online.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 2, "sentnum": 0}}
{"text": "I think the administrative and curricular aspects of the course are very well organized and present clear expectations.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 3, "sentnum": 0}}
{"text": "I also think the professor wants to teach an effective course and it shows.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 3, "sentnum": 1}}
{"text": "However I think the traditional lecture format is not a great pairing with his delivery style and the course could be made more effective by creating a more hands on coding environment for the students during the time.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 3, "sentnum": 2}}
{"text": "I would have preferred to take this course in an in person setting.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 4, "sentnum": 0}}
{"text": "I felt the virtual format made it more difficult for me to engage with the course material.", "meta": {"filename": "202220SEIS630-02.txt", "linenum": 4, "sentnum": 1}}
